# -*- coding: utf-8 -*-
from mysql import PyMySQLDatabase
import time,datetime
import urllib3
import requests
import json
import ipaddress,re
from information import IPInfo
urllib3.disable_warnings(urllib3.exceptions.InsecureRequestWarning)

class APIClient:
    def __init__(self):
        self.db = PyMySQLDatabase()
        self.url = "https://v5.gov110.cn:443/api/opnEventSrv/originalLogController/listOriginalLogs"
        self.token = 'eyJhbGciOiJIUzI1NiJ9.eyJ1c2VyVXVpZCI6ImZhMDA3MzM4NDY4NzQ0Y2Q4Njk2MzRjNmUxZGUyOTg0IiwicmFuZG9tQ29kZSI6ImM0N2ZmN2Q2ZDk2ODQ5Y2M5ODJlN2VlOTcyMWVlOWY0Iiwib3JnVXVpZCI6bnVsbH0.u6l-cmcEPLwKLxeWx4bA3Djx7PL28zzmhiZcZ7ESf-U'
        self.headers = {
            "User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:105.0) Gecko/20100101 Firefox/105.0",
            "Accept": "application/json, text/plain, */*",
            "Accept-Language": "zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2",
            "Accept-Encoding": "gzip, deflate",
            "Content-Type": "application/json;charset=utf-8",
            "token": self.token,
            "x-frame-options": "SAMEORIGIN",
            "Origin": "https://v5.gov110.cn",
            "Connection": "close",
            "Sec-Fetch-Dest": "empty",
            "Sec-Fetch-Mode": "cors",
            "Sec-Fetch-Site": "same-origin"
        }

    def send_request(self):
        self.ip_list = []
        self.current_date = datetime.date.today()
        # 获取当天起始时间
        self.start_of_day = datetime.datetime.combine(self.current_date, datetime.datetime.min.time())
        self.start_timestamp = int(time.mktime(self.start_of_day.timetuple()))
        # 获取当天结束时间
        self.end_of_day = datetime.datetime.combine(self.current_date, datetime.datetime.max.time())
        self.end_timestamp = int(time.mktime(self.end_of_day.timetuple()))
        self.data ={"startTime":str(self.start_timestamp)+"000","endTime":str(self.end_timestamp)+"000","logType":5,"aggKeyWord":"&typeName=连接","currentPage":1,"maxResults":5000,"result":"","eventGrade":"","userDataPermission":{"industryList":["教育","其他","卫生","党政机关","制造业","科技","信息传输、软件和信息技术服务业","科学研究和技术服务业","公共管理、社会保障和社会组织","人事劳动和社会保障","交通","能源","公安","交通运输、仓储和邮政业","水利","文化","电力、热力、燃气及水生产和供应业","批发和零售业","经营性公众互联网","铁路","金融业","国土资源","广电","电力","烟草","电信","住宿和餐饮业","卫生和社会工作","宣传","政法","文化、体育和娱乐业","水利、环境和公共设施管理业","租赁和商务服务业","测试","银行","商业贸易","国防科技工业","工商行政管理","房地产业","民航","海关","财政","质量监督检验检疫","金融","保险","农业","安全","证券","通信"],"industry":"","areaList":["滨湖区","惠山区","新吴区","锡山区","梁溪区","江阴市","无锡经济开发区","宜兴市","海淀区","赛罕区","西山区","芙蓉区","文峰区","西城区","历下区","新华区","朝阳区","武昌区","龙华区","新城区","天山区","小店区","麒麟区","松江区","天河区","渝北区","盘龙区","红谷滩区","越秀区","金山区","长宁区","闵行区","门头沟区","东湖区","丰台区","城关区","市中区","江岸区","秦淮区","青秀区","静安区","浦东新区","福田区","于田县","仓山区","南岗区","和田市","坪山区","天心区","宝安区","市辖区","开福区","新市区","栖霞区","武侯区","沙依巴克区","河东区","泰山区","洛浦县","浑南区","海州区","玄武区","美兰区","蜀山区","袁州区","裕华区","观山湖区","金水区","长安区","雁塔区","青山区","青山湖区","青羊区","鸠江区","鼓楼区","万全区","东西湖区","中原区","临翔区","临西县","二道区","五华区","亭湖区","伊宁市","伊州区","兖州区","兴宁市","兴庆区","北关区","南关区","南山区","南开区","南明区","南海区","历城区","双辽市","喀什市","回民区","城东区","城厢区","塔城市","大东区","安宁区","安源区","官渡区","宝山区","宣州区","宿城区","富拉尔基区","察布查尔锡伯自治县","岱岳区","岳阳县","崂山区","崇川区","广阳区","库尔勒市","建邺区","思茅区","拜城县","文山市","新建区","昌吉市","昌邑区","未央区","杏花岭区","桥东区","桥西区","民丰县","水磨沟区","永城市","江北区","江夏区","沙雅县","河西区","洪山区","浦口区","海拉尔区","海曙区","海珠区","涧西区","温宿县","灞桥区","牡丹区","牧野区","疏附县","皮山县","神木市","科尔沁区","科尔沁右翼前旗","章贡区","管城回族区","繁昌区","苏仙区","蔡甸区","虹口区","襄城区","襄都区","西湖区","迎泽区","都匀市","都昌县","鄞州区","鄯善县","钦北区","铁山港区","银州区","长沙县","阎良区","阿图什市","集宁区","集宁新区","雨花区","顺德区","香格里拉市","高新区","高邮市","鹿泉区","龙岗区"],"area":"","provinceList":["江苏省","北京市","新疆维吾尔自治区","广东省","云南省","上海市","内蒙古自治区","山东省","河北省","江西省","湖南省","河南省","湖北省","山西省","陕西省","安徽省","吉林省","四川省","广西壮族自治区","重庆市","甘肃省","贵州省","辽宁省","天津市","海南省","福建省","黑龙江省","浙江省","宁夏回族自治区","青海省"],"province":"江苏省,北京市,新疆维吾尔自治区,广东省,云南省,上海市,内蒙古自治区,山东省,河北省,江西省,湖南省,河南省,湖北省,山西省,陕西省,安徽省,吉林省,四川省,广西壮族自治区,重庆市,甘肃省,贵州省,辽宁省,天津市,海南省,福建省,黑龙江省,浙江省,宁夏回族自治区,青海省","cityList":["无锡市","呼和浩特市","昆明市","长沙市","深圳市","武汉市","石家庄市","南京市","南昌市","乌鲁木齐市","济南市","广州市","安阳市","和田地区","太原市","西安市","曲靖市","兰州市","成都市","郑州市","南宁市","沈阳市","泰安市","海口市","芜湖市","贵阳市","长春市","阿克苏地区","乌兰察布市","伊犁哈萨克自治州","佛山市","包头市","合肥市","哈尔滨市","喀什地区","宁波市","宜春市","张家口市","福州市","连云港市","邢台市","临沂市","临沧市","九江市","克孜勒苏柯尔克孜自治州","兴安盟","北海市","南通市","吉林市","吐鲁番市","呼伦贝尔市","哈密市","商丘市","四平市","塔城地区","宣城市","宿迁市","岳阳市","巴音郭楞蒙古自治州","廊坊市","扬州市","文山壮族苗族自治州","新乡市","昌吉回族自治州","普洱市","梅州市","榆林市","洛阳市","济宁市","盐城市","绵阳市","莆田市","菏泽市","萍乡市","襄阳市","西宁市","赣州市","迪庆藏族自治州","通辽市","郴州市","钦州市","铁岭市","银川市","青岛市","黔南布依族苗族自治州","齐齐哈尔市"],"city":"","unitList":["江苏国御科技有限公司","baimaohuiTest","ysjszc1","ysjszc2","万家寨水务控股集团有限公司","三菱电机空调影像设备（上海）有限公司","上海上源泵业制造有限公司","上海世界贸易商城有限公司","上海卡煜科技有限公司","上海吉运软件技术股份有限公司无锡分公司","上海市公安局金山分局网安支队","上海市松江区生态环境局","上海市质量监督检验技术研究院","上海弘卓网络（测试）施超","上海志在数据科技有限公司","上海恒源宝互联网科技有限公司","上海松江大学城建设发展有限公司","上海歌剧院","上海航天实业有限公司","上海载德信息科技股份有限公司","上海金山东方有线网络有限公司","上海铁路","上海长宁公共租赁住房运营有限公司","上海青年管理干部学院","东瑞盛世利融资租赁有限公司","中共巴音郭楞蒙古自治州委员会网络安全和信息化委员会办公室","中共济宁市兖州区委政法委员会","中共芜湖市委党校","中南林业科技大学","中国交通通信信息中心","中国人民政治协商会议云南省曲靖市委员会","中国人民政治协商会议广东省广州市委员会办公厅","中国企业管理无锡培训中心","中国共产党广州市委委员会党校","中国共产党无锡市锡山区委员会政法委员会","中国共产党曲靖市纪律检查委员会","中国华电科工集团有限公司","中国华电集团","中国广电江西网络有限公司","中国建筑股份有限公司","中国建设科技集团股份有限公司","中国建设银行湖南省分行","中国烟草总公司内蒙古自治区公司","中国电子口岸数据中心昆明分中心","中国移动通信集团湖南有限公司","中国空气动力研究与发展中心","中国第一重型机械股份公司","中国能源建设集团有限公司","中国航发动力股份有限公司","中国航空油料集团有限公司","中国铁路上海局集团有限公司","中国铁路哈尔滨局集团有限公司","中国铁路青藏集团有限公司","中国铝业集团有限公司","中国长江三峡集团有限公司","中城智慧科技有限公司","中央纪委国家监委","中山大涌医院","中检西南计量有限公司","中粮集团有限公司","中铁工程装备集团有限公司","中铁快运股份有限公司","中银保险有限公司","中银金融科技有限公司","临沧市人民医院","临西县人民政府","乌兰察布市日报社","乌兰察布自然资源局","乌鲁木齐市天山区人民政府办公室","乐观合芯物联网产业无锡有限公司","于田县卫健委","于田县教育局","云南南天电子信息产业股份有限公司","云南壮山实业股份有限公司","云南大学图书馆","云南广电网络集团有限公司曲靖分公司","云南省住房和城乡建设厅","云南省博物馆","云南省卫生健康综合监督中心","云南省国有资本运营有限公司","云南省地震局","云南省康旅控股集团有限公司","云南省文化和旅游厅","云南省生态环境厅","云南省福利彩票发行中心","云南省能源投资集团有限公司","伊犁州职业技术学院","佛山市南海区政务网络中心","佛山市顺德区政务服务数据管理局","克孜勒苏柯尔克孜自治州人民医院","公安部第一研究所2","公安部第一研究所通信技术事业部","兴宁市人民检察院","内蒙古1广播电视大学","内蒙古博物院","内蒙古广播电视局","内蒙古御网科技","内蒙古电子信息职业技术学院","内蒙古社会主义学院","内蒙古自治区人民防空办公室","内蒙古自治区兴安盟科尔沁右翼前旗居力很镇红心村","内蒙古自治区大数据发展管理局","内蒙古自治区应急管理厅","内蒙古自治区政务服务局","内蒙古自治区机构编制委员会办公室","内蒙古自治区红十字会","包头北奔重型汽车有限公司","包头稀土高新技术产业开发区管理委员会","北京中盾安全科技集团有限公司","北京乾云时代数据科技有限公司","北京国御科技","北京国御科技有限公司99","北京国御科技研发部","北京蓝城兄弟信息技术有限公司","北京讯威安通无线通信技术有限公司","北方实验室（沈阳）股份有限公司内部测试","北方实验室（沈阳）股份有限公司测试袁春雷","北部湾港北海码头有限公司","华能江阴燃机热电有限责任公司","华菱集团","南京市浦口区中心医院","南方医科大学深圳医院","南方医科大学深圳口腔医院（坪山）","南昌市房地产交易市场有限公司","南网互联网公司","南通通海港口有限公司","厦门市海沧医院","友阿云商","友阿集团","双辽职业中专","合肥通用机械研究院","吉林烟草工业有限责任公司","呼伦贝尔学院","呼和浩特市住建厅","呼和浩特市公安局","呼和浩特职业学院","和田地区人民医院","和田市维吾尔医医院","喀什地区第一人民医院","四川省教育厅","四川省自然资源厅","国家信访局","国家卫生健康委科学技术研究所","国家卫生健康委统计信息中心","国家药品监督管理局信息中心","国御测试注册码下发问题","国联人寿保险股份有限公司","国联信托股份有限公司","国联证券股份有限公司","国药控股无锡医疗器械有限公司","塔城地区公安局","大东区人民政府信息中心","大唐云南发电有限公司","大秦铁路股份有限公司","大航有能电气有限公司","天津图书馆","天津市档案局","天津海关","妇儿医院","学校测试","宁夏自治区药品监督管理局","宁波原水集团有限公司","宁波市体育发展中心","宁波市南天房地产经纪有限公司","安徽云探索网络科技有限公司","安阳学院","安阳市中汇鸿祺电子技术有限公司","安阳市人力资源和社会保障局","安阳市妇幼保健院","安阳市眼科医院","安阳市科学技术信息研究所","安阳市肿瘤医院","安阳日报社","宜兴卓数云计算有限公司","宜兴市交运物流信息科技有限公司","宜兴市人力资源和社会保障局","宜兴市人民医院","宜兴市卫生健康委员会","宜兴市妇幼保健院","宜兴市宜城街道臻喻信息咨询服务部","宜兴市急救中心","宜兴市档案史志馆","宜兴市疾病预防控制中心","宜兴市红塔医院","宜兴市自然资源和规划局","宜兴市融媒体中心","宜兴水务集团有限公司","宜兴港华燃气有限公司","宜春市财政局","宜春日报社","宣城市卫生健康委员会","宿迁市信访局","察布查尔锡伯自治县中医医院","小刀新能源科技股份有限公司","山东云天安全技术有限公司","山东省临沂市人民检察院","山东省气象服务中心","山东省社会信用中心","山东省药品监督管理局","山西按洽科技股份有限公司","山西数字政府建设运营有限公司","山西省福利彩票中心","山西省财政厅","岳阳县融媒体中心","帆软软件有限公司","广东力通网络科技有限公司","广东省农垦总局","广东省老干部大学","广东省防灾技术服务中心","广州安搏士信息科技","广州市轻工高级技工学校","广西南宁英福泰科信息科技有限公司","广西能汇投资集团有限公司","广西警察学院","廊坊市中级人民法院","张家口市住房公积金管理中心","张家口市电子政务管理中心","成都市武侯区教育技术装备与信息中心","成都生产力促进中心","扬州高邮大数据中心","拜城县人民医院","指北针供应链管理有限公司","新乡医学院第一附属医院&#40;河南省结核病医院&#41;","新兴县人民医院","新疆广电网络股份有限公司","新疆汇通互联信息科技有限责任公司","新疆玉象胡杨化工有限公司","新疆生产建设兵团住房公积金管理中心","新疆维吾尔自治区人民政府办公厅","新疆维吾尔自治区公安厅科信总队","新疆维吾尔自治区地质矿产勘查开发局第六地质大队","新疆维吾尔自治区污染物监控与信息中心","新疆维吾尔自治区疾病预防控制中心","新疆维吾尔自治区科学技术协会","新疆警察学院","旅游学院","无锡万斯家居科技股份有限公司","无锡三联医学检验有限公司","无锡东北塘幼儿园","无锡东旭科技商务有限公司","无锡东港工业区开发有限公司","无锡久耐聚氨酯制品有限公司","无锡亮源激光技术有限公司","无锡企业征信有限公司","无锡先锋高级中学","无锡兴达泡塑新材料股份有限公司","无锡凯宜医院有限公司","无锡凯数科技有限公司","无锡则安电力科技有限公司","无锡华泰医药包装有限公司","无锡卓瓷科技有限公司","无锡卫生高等职业技术学校","无锡友联热电股份有限公司","无锡君来酒店管理集团有限公司","无锡商业大厦大东方股份有限公司","无锡国家集成电路设计基地有限公司","无锡国御科技有限公司","无锡国联环保科技股份有限公司","无锡地铁集团有限公司","无锡城市职业技术学院","无锡城建发展集团有限公司","无锡夏利达漂染有限公司","无锡大志软件科技有限公司","无锡天惠超市股份有限公司","无锡太湖学院","无锡安信汽车集团有限公司","无锡安和健康科技有限公司","无锡小净共享网络科技有限公司","无锡市上元教育咨询有限公司","无锡市不锈钢电子交易中心有限公司","无锡市东北塘中学","无锡市东湖塘中心幼儿园","无锡市东绛第二实验学校","无锡市中医医院","无锡市中威酒店有限公司","无锡市人力资源和社会保障综合服务中心","无锡市人民医院","无锡市住房公积金管理中心","无锡市住房置业融资担保有限公司","无锡市儿童医院","无锡市公安局网安支队","无锡市匡园双语学校","无锡市华天双语学校","无锡市华庄中学","无锡市卫生监督所","无锡市厚桥中心幼儿园","无锡市司法局","无锡市后宅中心幼儿园","无锡市商务局","无锡市国联金属材料市场有限公司","无锡市地震监测预报中心","无锡市城市管理监督指挥中心","无锡市堰桥初级中学","无锡市天一实验学校","无锡市太湖格致中学","无锡市妇幼保健院","无锡市妇联实验托幼中心","无锡市宏宇汽车配件制造有限公司","无锡市实验幼儿园","无锡市山明水秀大饭店有限公司","无锡市峰影小学","无锡市峰影幼儿园","无锡市市北高级中学","无锡市建筑工程质量检测中心","无锡市惠山区人民医院","无锡市惠山区卫生健康委员会","无锡市惠山区康复医院","无锡市惠山区洛社新开河实验学校","无锡市惠山区特殊教育学校","无锡市惠山区第二人民医院","无锡市惠山区财政局","无锡市惠山区阳山镇人民政府","无锡市房屋管理服务中心","无锡市政公用环境检测研究院有限公司","无锡市政设计研究院有限公司","无锡市教育考试院","无锡市新吴区中海幼儿园","无锡市新吴区幸福外国语小学","无锡市新吴区旺庄实验小学","无锡市新吴区泰山路实验小学","无锡市新吴区鸿山实验小学","无锡市新吴区鸿山街道后宅社区卫生服务中心","无锡市新吴实验小学","无锡市新峰管业有限公司","无锡市新洲小学","无锡市新瑞医院","无锡市机关幼儿园","无锡市杨市中心小学","无锡市柏庄实验小学","无锡市梁溪区城市管理局","无锡市梁溪区妇幼保健计划生育服务中心","无锡市梁溪区教师发展中心","无锡市梅村中心幼儿园","无锡市森凯网络科技有限公司","无锡市民政局","无锡市水务集团有限公司","无锡市水秀中学","无锡市河埒中心小学","无锡市泰伯实验幼儿园","无锡市洛社中心小学","无锡市洛社高级中学","无锡市消防救援支队","无锡市滨湖中心小学","无锡市滨湖区卫生健康委员会","无锡市滨湖区妇幼保健计划生育服务中心","无锡市滨湖区教育康复中心","无锡市滨湖区桃园实验幼儿园","无锡市滨湖区水利局","无锡市滨湖区环境卫生管理处","无锡市滨湖区胡埭镇中心幼儿园","无锡市滨湖实验红山幼儿园","无锡市甘露实验小学","无锡市稻香实验小学","无锡市稻香实验幼儿园","无锡市立人小学","无锡市第一中学","无锡市第一女子中学","无锡市第三高级中学","无锡市第九人民医院","无锡市第五人民医院","无锡市第八人民医院","无锡市第六高级中学","无锡市精神卫生中心","无锡市羊尖实验小学","无锡市羊尖实验小学廊下小学","无锡市职工互助互济会","无锡市育红幼儿园","无锡市育英实验小学","无锡市育英锦园实验小学","无锡市胜利幼儿园","无锡市胡埭中学","无锡市胡埭中心小学","无锡市荡口中学","无锡市荡口中心幼儿园","无锡市荡口实验小学","无锡市蓝藻治理办公室","无锡市蠡园中学","无锡市蠡湖中心小学","无锡市辅仁高级中学","无锡市锡山中等专业学校","无锡市锡山人民医院","无锡市锡山区人民政府办公室","无锡市锡山区城市管理局","无锡市锡山区审计局","无锡市锡山区教育局","无锡市锡山区水利局","无锡市锡山实验小学","无锡市长安中心小学","无锡市长江液压缸有限公司","无锡市雪浪中心小学","无锡市雪浪中心幼儿园","无锡市雪浪仙河苑幼儿园","无锡市马山中心幼儿园","无锡幸运环保设备有限公司","无锡广播电视集团","无锡康贝电子设备有限公司","无锡开放大学","无锡开来帝森科技有限公司","无锡忻润汽车安全系统有限公司","无锡怡和妇产医院","无锡恒泰电缆机械制造有限公司","无锡恒鼎超级计算中心有限公司","无锡恰途网络科技有限公司","无锡惠山区住房和城乡建设局","无锡惠山泵业有限公司","无锡惠开人才发展集团有限公司","无锡惠联热电有限公司","无锡戴卡轮毂制造有限公司","无锡拈花湾文化投资发展有限公司","无锡拓谷信息技术有限公司","无锡教育电视台","无锡数字鲸科技有限公司","无锡数据湖信息技术有限公司","无锡文化艺术学校","无锡新联热力有限公司","无锡新诺唯软件有限公司","无锡旅游商贸高等职业技术学校","无锡日报报业集团","无锡明恒混合动力技术有限公司","无锡星邻网咖有限公司","无锡普天铁心股份有限公司","无锡普惠投资发展有限公司","无锡智汇交通科技有限公司","无锡正则精准医学检验有限公司","无锡正汉互联网医院有限公司","无锡汇华强盛医药连锁有限公司","无锡汇跑体育有限公司","无锡海之睿计算机科技有限公司","无锡海鸿信息技术有限公司","无锡淘神灯科技有限公司","无锡混沌能源技术有限公司","无锡漫途科技有限公司","无锡灵锡互联网有限公司","无锡睿健时代科技有限公司","无锡科技职业学院","无锡立信高等职业技术学校","无锡线上线下通讯信息技术股份有限公司","无锡职业技术学院","无锡艾迪讯电子科技有限公司","无锡英臻科技有限公司","无锡荣成环保科技有限公司","无锡蓝天燃机热电有限公司","无锡蜻蜓分类快递物流有限公司","无锡蠡园实验幼儿园","无锡行知科技学校","无锡西区燃气热电有限公司","无锡贝壳口腔门诊部有限公司","无锡远迈信息技术有限公司","无锡通用钢绳有限公司","无锡金洋铝业有限公司","无锡金茂商业中等专业学校","无锡锡商银行股份有限公司","无锡阿科力科技股份有限公司","无锡高新区金桥外国语学校","无锡鸿君环保科技有限公司","无锡鼎企不锈钢有限公司","昆明锦大二手车交易市场有限公司","星野测试","昱阳公司1","普洱市人民医院","景顺长城基金管理有限公司","曲靖市麒麟区人政府办公室","曲靖珠江网","松江区妇幼保健院","松花江网络有限公司","椒图","武汉京伦科技开发有限公司","武汉市仪表电子学校","武汉市金银潭医院","武汉车都集团有限公司","民丰县卫生健康委员会","水利部长江水利委员会","永城市人民政府办公室","江南中学","江南大学","江南大学附属医院南院区","江南影视艺术职业学院","江苏万安物流有限公司","江苏中建商品混凝土有限公司","江苏云工场信息技术有限公司","江苏亿翔云鸟信息技术有限公司","江苏信息职业技术学院","江苏公勤会计师事务所有限公司","江苏国御科技有限公司注册","江苏奥天利新材料有限公司","江苏安派科健康管理有限公司","江苏宜创久隆投资发展有限公司","江苏广电有线信息股份有限公司无锡分公司","江苏御维测试","江苏恒云太信息科技有限公司","江苏无锡经济开发区教育局","江苏智城慧宁交通科技有限公司","江苏汇聚云通智慧物流有限公司","江苏江南水务股份有限公司","江苏江阴农村商业银行股份有限公司","江苏物云通物流科技有限公司","江苏玉龙钢管科技有限公司","江苏瑞明生物科技有限公司","江苏省交通运输厅","江苏省产品质量监督检验研究院","江苏省天一中学","江苏省太湖高级中学","江苏省市场监督管理局","江苏省怀仁中学","江苏省惠山中等专业学校","江苏省无锡工商行政管理局","江苏省无锡市中级人民法院","江苏省无锡师范学校附属小学","江苏省无锡师范附属太湖新城小学","江苏省梅村高级中学","江苏省知识产权保护中心","江苏省科技统筹服务中心","江苏省荣军医院","江苏省计量科学研究院","江苏省质量和标准化研究院","江苏省锡山高级中学匡村实验学校","江苏省锡山高级中学实验学校第一小学","江苏艾思博信息技术有限公司","江苏菲沃泰纳米科技股份有限公司","江苏西维斯智能保安服务有限公司","江苏资产管理有限公司","江苏金禧智能卡管理有限公司","江苏韦兰德特种装备科技有限公司","江苏麟龙新材料股份有限公司","江西大成国有资产经营管理集团有限公司","江西工业贸易职业技术学院","江西省公共资源交易集团有限公司","江西省南昌市第三医院","江西省国有资本运营控股集团有限公司","江西省建筑设计研究总院集团有限公司","江西省投资集团有限公司","江西省红十字会","江西省都昌县人民医院","江西融合科技有限责任公司","江阴临港医院有限公司","江阴千麦医学检验实验室有限公司","江阴天力燃气有限公司","江阴市中医院","江阴市人民医院","江阴市公共交通有限公司","江阴市公用事业管理局","江阴市医疗保障局","江阴市卫生和计划生育委员会","江阴市城市综合管理局","江阴市大数据中心","江阴市富仁智能科技有限公司","江阴市总工会","江阴市恒亮纺织有限公司","江阴市教育信息化和装备管理服务中心","江阴市文体广电和旅游局","江阴市档案史志馆","江阴市融媒体中心","江阴市财政局","江阴智慧软件应用服务中心","江阴暨阳新体育产业有限公司","江阴欧维网络科技有限公司","江阴燃机热电有限公司","江阴精力汽车装备有限公司","江阴苏龙热电有限公司","江阴麦禾网络技术有限公司","河北医科大学第二医院","河北省会展促进中心","河北省住房和城乡建设厅","河北省发展和改革委员会","河北省商务厅","河北省安全生产监督管理局","河北省贸易发展中心","河北睿业信息技术有限公司","河南投资集团有限公司","河南省药监局","泰安市中心医院","泰安市泰山区教育和体育局","泰安市肿瘤防治院","洛浦县人民医院","洛浦县维吾尔医医院","洛阳北控水务集团有限公司","济南市住房和城乡建设局","济南市历城区教育和体育局","济南市残疾人联合会","济南市科学技术协会","浪潮通用软件有限公司","浪潮通用软件有限公司2","海南医学院","海南大学","海南开放大学远程教育学院","海澜智云科技有限公司","深圳市南山图书馆","深圳市当代艺术与城市规划馆","深圳市第三职业技术学校","深圳海关国际快件监管中心","深圳烟草工业有限责任公司","温宿县人民医院","湖北文理学院理工学院","湖北省教育出版社","湖北碳排放权交易中心有限公司","湖北铁路集团有限公司","湖南僖行天下科技有限公司","湖南明创信息系统集成有限公司","湖南省国资委","湖南省地方金融监督管理局","湖南省计量检测研究院","珠海市人民医院","甘肃海丰信息科技有限公司_测试","甘肃省疾控中心","甘肃省科学技术协会","甘肃省高速公路联网收费清分结算中心","疏附县水利局","皮山县人民医院","盐城市经济开发区分局网安大队","石家庄以岭药业股份有限公司","石家庄市第一医院","石家庄市第四医院","石家庄市长安区人民政府办公室","矿冶科技集团有限公司","神木市人民政府办公室","福州市教育局","福州市第九中学","福村宝医疗科技有限公司","科睿特软件集团股份有限公司","红豆电信有限公司","红豆集团有限公司","网罗天下信息技术江阴有限公司","芜湖市智慧城市管理指挥中心","芜湖市轨道交通有限公司","苏南硕放国际机场有限公司","苏州工业园区金赋智远数据科技有限公司","莆田市第一中学","菏泽市人力资源和社会保障厅","萍乡市人民医院","西安市国际港务区","西安市阎良区医疗卫生信息化管理中心","贵州省市场监督管理局","贵州省黔南布依族苗族自治州中级人民法院","贵阳宏图科技有限公司","贵阳市交通运输综合行政执法支队","远东买卖宝网络科技有限公司","连云港市人力资源和社会保障局","连云港市自然资源和规划局","连城凯克斯科技有限公司","迪庆州住房公积金管理中心","通辽市精神卫生中心","邢台市第二医院","邦道科技有限公司","邮储银行","郑州烟草研究院","郴州市第四人民医院","鄯善县水利局","重庆市公安局","重庆市水利投资（集团）有限公司","重庆燃气集团股份有限公司","鑫恒绅企业服务有限公司","钦州市住房公积金管理中心","铁岭市消防救援支队","银盛通信有限公司","长宁档案局","长春市信息中心","长春市净月高新技术产业开发区","长江航务管理局","长江航务管理局02","长江航道测量中心02","长沙市第一医院","陕西公众信产有限公司","陕西测试","雄宇重工集团股份有限公司","雅迪科技集团有限公司","青岛冠成软件有限公司","龙岗区第三人民医院","中国共产主义青年团内蒙古自治区委员会","无锡吴文化博览园建设发展有限公司","无锡国泰精密机件有限公司","松江二中","湖南长银融资担保有限公司","中银消费金融有限公司","内蒙古自治区住房住房资金管理中心","安阳城乡水务集团有限公司","无锡伟达五金有限公司","无锡市公共交通集团有限公司","无锡市教师发展学院","朗新科技集团股份有限公司","江苏小度网络运营服务有限公司","深圳市人大常委会办公厅","联掌门户网络科技有限公司"],"unit":"","accessCode":None,"type":"unit","verify":True},"count":6,"innerIp":"","keyWordOriginal":"","token":self.token}
        try:
            self.list_log = requests.post(self.url, headers=self.headers, json=self.data, verify=False, timeout=10)
            if len(self.list_log.text) > 100000:
                for num in self.list_log.json()['data']["list"]:
                    self.intranetIp = num['machine']['intranetIp']
                    self.log = num['action']['text']
                    try:
                        self.extranetIp = \
                        re.search(r'\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}:\d+', self.log).group().split(":")[
                            0]
                    except Exception as err:
                        self.extranetIp = None
                    self.standardTimestamp = str(
                        datetime.datetime.fromtimestamp(int(str(num['standardTimestamp']).replace('000', ''))))
                    self.group = num['unit']
                    if self.intranetIp is not None and self.is_public_ip(
                            self.extranetIp) and self.intranetIp != self.extranetIp:
                        self.gov_data = [self.group, self.standardTimestamp, self.intranetIp, self.extranetIp, self.log]
                        self.ip_list.append(self.gov_data)
            else:
                print("数据较少，不太符合预期。正在重试！")
                self.send_request()
        except:
            pass
        if self.ip_list and len(self.ip_list)>1:
            return self.ip_list


    def is_public_ip(self,ip_address):
        try:
            parsed_ip = ipaddress.ip_address(ip_address)
            # 检查IP地址是否属于内网IP地址范围
            if parsed_ip.is_private:
                return False
            else:
                return True
        except ValueError:
            return False
if __name__ == '__main__':
    hello = APIClient()
    while True:
        ip_list = hello.send_request()
        web_requester = IPInfo()
        if ip_list and len(ip_list) > 1:
            web_requester.make_requests(ip_list)
        #time.sleep(20)